SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-82014T

Comment( British Rail STD 3MT 82014 2-6-2 Tank Engine )

Comment  ( *****  Minimum OR Parameters - Wagon Section ****** )
	
Comment ( General Information Included in this section - Type, Shape, Size, Mass, etc )

Type ( Engine )
WagonShape ( DR_BR_3MT_82014.s )
Size  ( 2.79516m 3.96468m 12.037767m )
Mass ( 74.05t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 0cm 0cm )
              )
          CouplingHasRigidConnection (1)
     )  

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 203kN ) Comment(55% WWO Weight*Cof 0.5)
MaxHandbrakeForce ( 74kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 14.0ft )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment( CN 1990 18xDW )
ORTSDavis_A ( 5325 )
ORTSDavis_B ( 24.76 )
ORTSDavis_C ( 5.128 )

ORTSWagonFrontalArea (96ft^2)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	( 8
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( -0 2.0 -2.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -0 2.2 -2.6 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
								)
						)
			)
		Light	(
			comment( Cab glow )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				TimeOfDay ( 0 )

			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff7200 )
					Position ( 0 2.2 -2.6 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.2 )
					)
				)
			)
		Light	(
			comment( flickering fire underneath LHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 0 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 1 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( flickering fire underneath RHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 0 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( Front White Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( aaffffee )
						Position ( 0 3.18 4.84 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Front Red Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( 80ff0000 )
						Position ( 0 3.18 4.84 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Rear Red Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0 3.08 -5.68 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		Light	(
			comment( Rear White Reversed Position A )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaffffee )
					Position ( 0 3.08 -5.68 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		)


Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

FreightAnim ( "..\\common.crew\\LIB_2\\Std4Tank.s" 0 3.0 0.0 )

Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( DR_BR_3MT_82014.s )
        PassengerCabinHeadPos ( 1.455 3.2 -2.3 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	IntakePoint ( 0.9 10 FuelWater )
	IntakePoint ( -0.9 8 FuelCoal )
    
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)




Engine ( OR-82014T
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 3.781 -1.748
				0 -1 0
				0.3
			)

			SafetyValvesFX
			(
				0 3.971 -1.15
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 3.971 -1.45
				0 1 0
				0.2
			)
			StackFX
			(
				0 3.996 3.8
				0 1 0
				0.3
			)
			StackFX
			(
				0 3.996 3.8
				0 1 0
				0.25
			)
			StackFX
			(
				0 3.996 3.8
				0 0.95 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			Injectors2FX
			(
				1.22 0.65 -2.8
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.22 0.65 -3
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-0.965 0.845 4.5
				0 0.1 1
				0.20
			)

			CylindersFX
			(
				0.965 0.845 4.5
				0 0.1 1
				0.20
			)
		)
	)

Wagon ( OR-82014T )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 31.5in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 48.75t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 138ft^3 ) 
ORTSEvaporationArea ( 1042ft^2 )
ORTSSuperheatArea ( 118ft^2 )
MaxBoilerPressure ( 200psi )
MaxSteamHeatingPressure ( 70psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 17.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 20.35ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 3t-uk )
MaxTenderWaterMass ( 15000lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15.0 ) Comment(to give max steam rate 15600lb/hr)

ORTSMaxIndicatedHorsepower ( 1100.0hp ) 

ORTSMaxSuperheatTemperature ( 260.0 )

Comment (ORTSSuperheatCutoffPressureFactor ( 45.0 ))

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 )Comment(From Report)

Comment(ORTSBurnRate( 0.0 10.0   9714.0 1000.0   17714.0 2000.0   23714.0 3000.0   28571.0 4000.0   31428.0 5000.0   33428.0 6000.0 ))

Comment(ORTSBurnRate( 0.0 10.0  8800.0 1000.0  13900.0 2000.0  16500.0 2500.0  17700.0 3000.0  19900.0 3500.0  21300.0 4000.0 )) Comment( From Pawson Graph + 4% worse )

ORTSBurnRate( 0.0 10.0  8500.0 1000.0  13400.0 2000.0  15870.0 2500.0  17000.0 3000.0  19100.0 3500.0  20550.0 4000.0 ) Comment( From Pawson Graph )


ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 )

Comment(ORTSCylinderBackPressure ( 0.0 0.0  2500 18.0 ))


Comment ( ***********Gearing (If used) *************************
Included in this section - Gear type, ratio, etc )

Comment ( *****************Brake System ********************        Included in this section - Compressor, Reservoir, Application rates, etc )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21 )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control System (if used)**********        
Includes Monitoring of Overspeed, Vigilance, Emergency Braking)

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
            ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

	Cabview ( Standard4Tank.cvf )
	HeadOut (  -1.455 3.2 -2.3 )
 
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
    	Name ( "82014-Standard 3MT Tank, Coal 3t Water 1500gal" )
 	Description (
 	"The class had a short life as most of the work that they had been built for soon disappeared with the branch lines and the introduction of DMU services on shorter routes. The shortest lived was 82043, only 8 years 8 months old at withdrawal; the longest lived was 82019, two months short of its fifteenth birthday. The class' design life, however, was 40 years. There were plans to build locomotives nos. 82045 to 82062, however, these were cancelled."
)
)